USE `lab4`;

/* ------------------------------------------------- 00002_create_users_table.sql ------------------------------------------------------- */

INSERT INTO `users` (`id`, `email`, `password_hash`, `first_name`, `last_name`) VALUES

/* for simplicity all passwords set to password */
(1,     'MartynyukAlexey05@yandex.ru',  '$2y$10$15LQUqCsibLJvD2Zf8mHx.gq.dX0jIPU58EtRx1V8v2/ElmQK6wY.',  'Алексей',      'Мартынюк'),
(2,     'alwaysbebetter@mail.ru',       '$2y$10$15LQUqCsibLJvD2Zf8mHx.gq.dX0jIPU58EtRx1V8v2/ElmQK6wY.',  'Анастасия',    'Садовая');

/* ------------------------------------------------- 00003_create_user_addresses_table.sql ------------------------------------------- */

INSERT INTO `user_addresses` (`id`, `user_id`, `address`, `postcode`) VALUES

(1,  1,     'ул. Тверская, д. 1, кв. 10, Москва',                   854239),
(2,  1,     'Невский проспект, д. 28, кв. 15, Санкт-Петербург',     219876),
(3,  1,     'ул. Ленина, д. 5, кв. 7, Екатеринбург',                620014),
(4,  1,     'Красный проспект, д. 10, кв. 3, Новосибирск',          463982),
(5,  1,     'ул. Баумана, д. 3, кв. 12, Казань',                    420111),
(6,  1,     'ул. Большая Садовая, д. 45, кв. 8, Ростов-на-Дону',    344002),

(7,  2,     'пр. Ленина, д. 20, кв. 5, Челябинск',                  454091),
(8,  2,     'ул. Ленина, д. 5, кв. 7, Екатеринбург',                982135),
(9,  2,     'ул. Баумана, д. 3, кв. 12, Казань',                    756421),
(10, 2,     'стр. Тверская, д. 1, кв. 10, Москва',                  493817),
(11, 2,     'пр. Ленина, д. 20, кв. 5, Челябинск',                  982467),
(12, 2,     'ул. Шоссейная, д. 45, кв. 8, Ростов-на-Дону',          135792);

/* ------------------------------------------------- 00004_create_products_table.sql ---------------------------------------------------- */

INSERT INTO `products` (`id`, `name`, `price`, `stock`, `image_url`) VALUES

/* category_id = 1, "Электроника" */
(010001,   'Ноутбук Lenovo IdeaPad 15IKB, 15.6"',   49990,   43,  'https://ir.ozone.ru/s3/multimedia-5/wc1000/6836926205.jpg'),
(010002,   'Смартфон Samsung Galaxy A50, 6.4"',     23990,   18,  'https://ir.ozone.ru/s3/multimedia-1-2/wc1000/6962630534.jpg'),
(010003,   'Смартфон Apple iPhone 11 64Gb, 6.1"',   64990,   91,  'https://ir-2.ozone.ru/s3/multimedia-s/wc1000/6906245428.jpg'),
(010004,   'Компьютер Apple iMac 21.5"',            99990,   64,  'https://ir-2.ozone.ru/s3/multimedia-1-0/wc1000/7139733840.jpg'),
(010005,   'Смартфон Samsung Galaxy A72, 6.7"',     23990,   75,  'https://ir-2.ozone.ru/s3/multimedia-6/wc1000/6810301326.jpg'),
(010006,   'Компьютер Apple iMac 27" 5K',           169990,  82,  'https://ir-2.ozone.ru/s3/multimedia-1-2/wc1000/7139733842.jpg'),
(010007,   'Планшет Apple iPad 10.2", 128Gb',       34990,   97,  'https://ir-2.ozone.ru/s3/multimedia-1-o/wc1000/7182686568.jpg'),
(010008,   'Tecno Смартфон SPARK 30C Ростест',      9990,    55,  'https://ir.ozone.ru/s3/multimedia-1-6/wc1000/7149559710.jpg'),
(010009,   'Смарт-часы Apple Watch Series 5 40mm',  24990,   76,  'https://ir.ozone.ru/s3/multimedia-s/wc1000/6770521852.jpg'),
(010010,   'Ноутбук HP Envy 15-eh0013ur, 15.6"',    42990,   41,  'https://ir.ozone.ru/s3/multimedia-1-s/wc1000/7155024184.jpg'),
(010011,   'Realme Смартфон Note 50 3/64 ГБ',       5990,    34,  'https://ir.ozone.ru/s3/multimedia-1-b/wc1000/7184523131.jpg'),
(010012,   '',     54990,   58,  ''),
(010013,   '',     54990,   45,  ''),
(010014,   '',     54990,   29,  ''),
(010015,   '',     54990,   52,  ''),

/* category_id = 2, "Одежда" */
(020001,  'Джинсы DENIM STR',                       2773,    13,  'https://ir.ozone.ru/s3/multimedia-1-g/wc1000/7099706068.jpg'),
(020002,  'Пуховик LIBERTA',                        8873,    97,  'https://ir.ozone.ru/s3/multimedia-1-9/wc1000/7128643869.jpg'),
(020003,  'Комплект термобелья Edin',               1963,    27,  'https://ir.ozone.ru/s3/multimedia-1-p/wc1000/7216735849.jpg'),
(020004,  'Футболка Fosfor',                        521,     54,  'https://ir.ozone.ru/s3/multimedia-y/wc1000/6810434818.jpg'),
(020005,  'Пижама Виктория Ваганова',               443,     89,  'https://ir.ozone.ru/s3/multimedia-1-3/wc1000/7185306783.jpg'),
(020006,  'Брюки GJ Ready! Steady! Go!',            793,     36,  'https://ir.ozone.ru/s3/multimedia-1-1/wc1000/7038766945.jpg'),
(020007,  'Брюки утепленные TopYoungs',             1936,    41,  'https://ir.ozone.ru/s3/multimedia-1-d/wc1000/7195767313.jpg'),
(020008,  'Свитер женский',                         985,     63,  'https://ir.ozone.ru/s3/multimedia-1-9/wc1000/6957501453.jpg'),
(020009,  'Свитшот MOD JEANS',                      1256,    49,  'https://ir.ozone.ru/s3/multimedia-1-j/wc1000/7192696843.jpg'),
(020010,  'Женские леггинсы',                       582,     22,  'https://ir.ozone.ru/s3/multimedia-1-8/wc1000/7168004576.jpg'),
(020011,  'Халат TIME STYLE',                       1097,    85,  'https://ir.ozone.ru/s3/multimedia-7/wc1000/6732392875.jpg'),
(020012,  'Пуховик SilverFox',                      20990,   67,  'https://ir.ozone.ru/s3/multimedia-m/wc1000/6799266130.jpg'),
(020013,  'Футболка GJ Ready! Steady! Go!',         299,     67,  'https://ir.ozone.ru/s3/multimedia-1-2/wc1000/6997263662.jpg'),
(020014,  'Лонгслив Fiolerin',                      683,     67,  'https://ir.ozone.ru/s3/multimedia-1-a/wc1000/7135841674.jpg'),
(020015,  'Лонгслив NEWLUCKY',                      1477,    67,  'https://ir.ozone.ru/s3/multimedia-1-i/wc1000/7202141082.jpg'),

/* category_id = 3, "Обувь" */
(030001,  'Мужские кеды Adidas, белые, 42',                                        4990,    67,  ''),

/* category_id = 4, "Книги" */
(040001,  'Литературный журнал, посвященный истории и культуре',                   4990,    50,  ''),

/* category_id = 5, "Спорт и отдых" */
(050001,  'Беговая дорожка для дома, до 30 км/ч, 4 уровня наклона',                22990,   10,  ''),

/* category_id = 6, "Дом и сад" */
(060001,  'Органическое удобрение для цветов, деревьев и овощей',                  490,     20,  ''),

/* category_id = 7, "Красота и здоровье" */
(070001,  'Крем от морщин на основе натуральных компонентов',                     1990,    15,  ''),

/* category_id = 8, "Продукты питания" */
(080001, 'Кокосовое масло холодного отжима',                                     990,     20,  ''),

/* category_id = 9, "Игрушки" */
(090001, 'Кукла 30 см',                                                          990,     10,  ''),

/* category_id = 10, "Автотовары" */
(100001, 'Масло моторное 5 л',                                                   1990,     47,  '');

/* ------------------------------------------------- 00005_create_categories_table.sql -------------------------------------------------- */

INSERT INTO `categories` (`id`, `name`, `description`) VALUES

(1,     'Электроника',         'Компьютеры, смартфоны, планшеты и другие электронные устройства'),
(2,     'Одежда',              'Мужская, женская и детская одежда различных стилей'),
(3,     'Обувь',               'Разнообразная обувь для всех сезонов'),
(4,     'Книги',               'Художественная литература, учебники, и научно-популярные издания'),
(5,     'Спорт и отдых',       'Спортивный инвентарь, оборудование для активного отдыха'),
(6,     'Дом и сад',           'Товары для дома, мебель, садовый инвентарь'),
(7,     'Красота и здоровье',  'Косметика, средства по уходу за собой, товары для здоровья'),
(8,     'Продукты питания',    'Продукты питания и напитки'),
(9,     'Игрушки',             'Игрушки и игры для детей разных возрастов'),
(10,    'Автотовары',          'Аксессуары и запчасти для автомобилей');

/* ------------------------------------------------- 00006_create_product_category_table.sql -------------------------------------------- */

INSERT INTO `product_category` (`product_id`, `category_id`) VALUES

(010001, 1), (020001, 2), (030001, 3), (040001, 4), (050001, 5), (060001, 6), (070001, 7), (080001, 8), (090001, 9), (100001, 10),
(010002, 1), (020002, 2),
(010003, 1), (020003, 2), 
(010004, 1), (020004, 2),
(010005, 1), (020005, 2),
(010006, 1), (020006, 2),
(010007, 1), (020007, 2),
(010008, 1), (020008, 2),
(010009, 1), (020009, 2),
(010010, 1), (020010, 2),
(010011, 1), (020011, 2),
(010012, 1), (020012, 2),
(010013, 1), (020013, 2),
(010014, 1), (020014, 2),
(010015, 1), (020015, 2);

/* ------------------------------------------------- 00007_create_orders_table.sql ------------------------------------------------------ */

INSERT INTO `orders` (`id`,`user_id`, `address_id`, `status`, `created_at`, `updated_at`) VALUES

(1,    1,     1,    'canceled',     '2024-11-03 14:46:43',          '2024-11-03 15:51:17'),
(2,    1,     2,    'completed',    '2024-11-13 08:30:41',          '2024-11-17 13:35:15'),
(3,    1,     3,    'progress',     '2024-12-02 12:59:09',          '2024-12-02 13:23:06');

/* ------------------------------------------------- 00008_create_orders_items_table.sql ------------------------------------------------ */

INSERT INTO `order_items` (`order_id`, `product_id`, `amount`, `price_per_unit`) VALUES

(1, 010001, 1, 1990.00),
(1, 010007, 1, 2990.00), 
(2, 020003, 1, 7990.00),
(3, 020008, 1, 11990.00);
